; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l3-t1-p9---int100n150-m25---int100c150---s100---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 - location
t0 - truck
p0 p1 p2 p3 p4 p5 p6 p7 p8 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 level59 level60 level61 level62 level63 level64 level65 level66 level67 level68 level69 level70 level71 level72 level73 level74 level75 level76 level77 level78 - fuellevel
)

(:init
(sum level0 level4 level4)
(sum level0 level24 level24)
(sum level1 level4 level5)
(sum level1 level24 level25)
(sum level2 level4 level6)
(sum level2 level24 level26)
(sum level3 level4 level7)
(sum level3 level24 level27)
(sum level4 level4 level8)
(sum level4 level24 level28)
(sum level5 level4 level9)
(sum level5 level24 level29)
(sum level6 level4 level10)
(sum level6 level24 level30)
(sum level7 level4 level11)
(sum level7 level24 level31)
(sum level8 level4 level12)
(sum level8 level24 level32)
(sum level9 level4 level13)
(sum level9 level24 level33)
(sum level10 level4 level14)
(sum level10 level24 level34)
(sum level11 level4 level15)
(sum level11 level24 level35)
(sum level12 level4 level16)
(sum level12 level24 level36)
(sum level13 level4 level17)
(sum level13 level24 level37)
(sum level14 level4 level18)
(sum level14 level24 level38)
(sum level15 level4 level19)
(sum level15 level24 level39)
(sum level16 level4 level20)
(sum level16 level24 level40)
(sum level17 level4 level21)
(sum level17 level24 level41)
(sum level18 level4 level22)
(sum level18 level24 level42)
(sum level19 level4 level23)
(sum level19 level24 level43)
(sum level20 level4 level24)
(sum level20 level24 level44)
(sum level21 level4 level25)
(sum level21 level24 level45)
(sum level22 level4 level26)
(sum level22 level24 level46)
(sum level23 level4 level27)
(sum level23 level24 level47)
(sum level24 level4 level28)
(sum level24 level24 level48)
(sum level25 level4 level29)
(sum level25 level24 level49)
(sum level26 level4 level30)
(sum level26 level24 level50)
(sum level27 level4 level31)
(sum level27 level24 level51)
(sum level28 level4 level32)
(sum level28 level24 level52)
(sum level29 level4 level33)
(sum level29 level24 level53)
(sum level30 level4 level34)
(sum level30 level24 level54)
(sum level31 level4 level35)
(sum level31 level24 level55)
(sum level32 level4 level36)
(sum level32 level24 level56)
(sum level33 level4 level37)
(sum level33 level24 level57)
(sum level34 level4 level38)
(sum level34 level24 level58)
(sum level35 level4 level39)
(sum level35 level24 level59)
(sum level36 level4 level40)
(sum level36 level24 level60)
(sum level37 level4 level41)
(sum level37 level24 level61)
(sum level38 level4 level42)
(sum level38 level24 level62)
(sum level39 level4 level43)
(sum level39 level24 level63)
(sum level40 level4 level44)
(sum level40 level24 level64)
(sum level41 level4 level45)
(sum level41 level24 level65)
(sum level42 level4 level46)
(sum level42 level24 level66)
(sum level43 level4 level47)
(sum level43 level24 level67)
(sum level44 level4 level48)
(sum level44 level24 level68)
(sum level45 level4 level49)
(sum level45 level24 level69)
(sum level46 level4 level50)
(sum level46 level24 level70)
(sum level47 level4 level51)
(sum level47 level24 level71)
(sum level48 level4 level52)
(sum level48 level24 level72)
(sum level49 level4 level53)
(sum level49 level24 level73)
(sum level50 level4 level54)
(sum level50 level24 level74)
(sum level51 level4 level55)
(sum level51 level24 level75)
(sum level52 level4 level56)
(sum level52 level24 level76)
(sum level53 level4 level57)
(sum level53 level24 level77)
(sum level54 level4 level58)
(sum level54 level24 level78)
(sum level55 level4 level59)
(sum level56 level4 level60)
(sum level57 level4 level61)
(sum level58 level4 level62)
(sum level59 level4 level63)
(sum level60 level4 level64)
(sum level61 level4 level65)
(sum level62 level4 level66)
(sum level63 level4 level67)
(sum level64 level4 level68)
(sum level65 level4 level69)
(sum level66 level4 level70)
(sum level67 level4 level71)
(sum level68 level4 level72)
(sum level69 level4 level73)
(sum level70 level4 level74)
(sum level71 level4 level75)
(sum level72 level4 level76)
(sum level73 level4 level77)
(sum level74 level4 level78)

(connected l0 l1)
(fuelcost level4 l0 l1)
(connected l0 l2)
(fuelcost level24 l0 l2)
(connected l1 l0)
(fuelcost level4 l1 l0)
(connected l1 l2)
(fuelcost level24 l1 l2)
(connected l2 l0)
(fuelcost level24 l2 l0)
(connected l2 l1)
(fuelcost level24 l2 l1)

(at t0 l2)
(fuel t0 level78)
(= (total-cost) 0)

(at p0 l0)
(at p1 l0)
(at p2 l0)
(at p3 l0)
(at p4 l2)
(at p5 l2)
(at p6 l0)
(at p7 l1)
(at p8 l0)
)

(:goal
(and
(at p0 l1)
(at p1 l2)
(at p2 l1)
(at p3 l2)
(at p4 l1)
(at p5 l0)
(at p6 l2)
(at p7 l2)
(at p8 l2)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p5 t0 l2)
   deleted: (at p5 l2)
   added: (in p5 t0)
   goals met: 0 of 9
2. (load p4 t0 l2)
   deleted: (at p4 l2)
   added: (in p4 t0)
   goals met: 0 of 9
3. (drive t0 l2 l0 level54 level24 level78)
   deleted: (at t0 l2) (fuel t0 level78)
   added: (at t0 l0) (fuel t0 level54)
   goals met: 0 of 9
4. (unload p5 t0 l0)
   deleted: (in p5 t0)
   added: (at p5 l0)
   goals met: 1 of 9
5. (load p8 t0 l0)
   deleted: (at p8 l0)
   added: (in p8 t0)
   goals met: 1 of 9
6. (load p6 t0 l0)
   deleted: (at p6 l0)
   added: (in p6 t0)
   goals met: 1 of 9
7. (load p3 t0 l0)
   deleted: (at p3 l0)
   added: (in p3 t0)
   goals met: 1 of 9
8. (load p2 t0 l0)
   deleted: (at p2 l0)
   added: (in p2 t0)
   goals met: 1 of 9
9. (load p1 t0 l0)
   deleted: (at p1 l0)
   added: (in p1 t0)
   goals met: 1 of 9
10. (load p0 t0 l0)
   deleted: (at p0 l0)
   added: (in p0 t0)
   goals met: 1 of 9
11. (drive t0 l0 l1 level50 level4 level54)
   deleted: (at t0 l0) (fuel t0 level54)
   added: (at t0 l1) (fuel t0 level50)
   goals met: 1 of 9
12. (load p7 t0 l1)
   deleted: (at p7 l1)
   added: (in p7 t0)
   goals met: 1 of 9
13. (unload p0 t0 l1)
   deleted: (in p0 t0)
   added: (at p0 l1)
   goals met: 2 of 9
14. (unload p2 t0 l1)
   deleted: (in p2 t0)
   added: (at p2 l1)
   goals met: 3 of 9
15. (unload p4 t0 l1)
   deleted: (in p4 t0)
   added: (at p4 l1)
   goals met: 4 of 9
16. (drive t0 l1 l2 level26 level24 level50)
   deleted: (at t0 l1) (fuel t0 level50)
   added: (at t0 l2) (fuel t0 level26)
   goals met: 4 of 9
17. (unload p1 t0 l2)
   deleted: (in p1 t0)
   added: (at p1 l2)
   goals met: 5 of 9
18. (unload p3 t0 l2)
   deleted: (in p3 t0)
   added: (at p3 l2)
   goals met: 6 of 9
19. (unload p6 t0 l2)
   deleted: (in p6 t0)
   added: (at p6 l2)
   goals met: 7 of 9
20. (unload p7 t0 l2)
   deleted: (in p7 t0)
   added: (at p7 l2)
   goals met: 8 of 9
21. (unload p8 t0 l2)
   deleted: (in p8 t0)
   added: (at p8 l2)
   goals met: 9 of 9
